### 피벗 매소드

In [2]:
import pandas as pd
import numpy as np

In [3]:
data = {
    "도시": ["서울", "서울", "서울", "부산", "부산", "부산", "인천", "인천"],
    "연도": ["2015", "2010", "2005", "2015", "2010", "2005", "2015", "2010"],
    "인구": [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 263203],
    "지역": ["수도권", "수도권", "수도권", "경상권", "경상권", "경상권", "수도권", "수도권"]
}
columns = ["도시", "연도", "인구", "지역"]
df1 = pd.DataFrame(data, columns=columns)
df1

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010   263203  수도권

In [7]:
# index, column, value
df1.pivot("도시", "연도", "인구")

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

__________________________________________  

### 그룹분석

In [8]:
np.random.seed(0)
df2 = pd.DataFrame({
    'key1': ['A', 'A', 'B', 'B', 'A'],
    'key2': ['one', 'two', 'one', 'two', 'one'],
    'data1': [1, 2, 3, 4, 5],
    'data2': [10, 20, 30, 40, 50]
})
df2

  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
2    B  one      3     30
3    B  two      4     40
4    A  one      5     50

In [12]:
# df2의 key1을 기준으로 묶어서 합계를 구한다.
df2.groupby(df2.key1).sum()

      data1  data2
key1
A         8     80
B         7     70

In [13]:
df2.groupby(df2.key2).sum()

      data1  data2
key2
one       9     90
two       6     60

In [14]:
df2.groupby(df2.key2).mean()['data2']

key2
one    30
two    30
Name: data2, dtype: int64

In [15]:
# 두개를 기준으로 groupby
df2.groupby([df2.key1,df2.key2]).sum()

           data1  data2
key1 key2
A    one       6     60
     two       2     20
B    one       3     30
     two       4     40

In [16]:
import seaborn as sns

In [19]:
titanic = sns.load_dataset('titanic')

In [20]:
# pclass 먼저, 그다음 sex로 groupby 한 다음 mean을 한다. 
titanic.age.groupby([titanic.pclass,titanic.sex]).mean()

pclass  sex
1       female    34.611765
        male      41.281386
2       female    28.722973
        male      30.740707
3       female    21.750000
        male      26.507589
Name: age, dtype: float64

In [22]:
iris = sns.load_dataset('iris')
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

* agg : 일종의 매핑함수, 여러개의 함수를 여러 열에 적용하고자 할 때

In [23]:
def peak_to_peak_ratio(x):
    return x.max() / x.min()

iris.groupby(iris.species).agg(peak_to_peak_ratio)

            sepal_length  sepal_width  petal_length  petal_width
species
setosa          1.348837     1.913043      1.900000     6.000000
versicolor      1.428571     1.700000      1.700000     1.800000
virginica       1.612245     1.727273      1.533333     1.785714

In [25]:
iris.groupby(iris.species).agg(lambda x : x.max() - x.min())

            sepal_length  sepal_width  petal_length  petal_width
species
setosa               1.5          2.1           0.9          0.5
versicolor           2.1          1.4           2.1          0.8
virginica            3.0          1.6           2.4          1.1

### pivot table

In [27]:
# 숫자같은 경우 자동으로 집계를 해준다.

df1.pivot("도시","연도","인구")

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

In [31]:
# 순서에 주의
# margins=True, margins_name="합계" 를 주면 행/열별 결과도 보여준다.
df1.pivot_table("인구", "도시", "연도")

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

### tips 데이터 사례

In [32]:
tips = sns.load_dataset('tips')
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [34]:
tips['tip_pct'] = (tips.tip / tips.total_bill) * 100
tips.head()

   total_bill   tip     sex smoker  day    time  size    tip_pct
0       16.99  1.01  Female     No  Sun  Dinner     2   5.944673
1       10.34  1.66    Male     No  Sun  Dinner     3  16.054159
2       21.01  3.50    Male     No  Sun  Dinner     3  16.658734
3       23.68  3.31    Male     No  Sun  Dinner     2  13.978041
4       24.59  3.61  Female     No  Sun  Dinner     4  14.680765

In [35]:
# 성별 데이터 갯수
tips.groupby(tips.sex).count()

        total_bill  tip  smoker  day  time  size  tip_pct
sex
Male           157  157     157  157   157   157      157
Female          87   87      87   87    87    87       87

In [36]:
tips.groupby(['sex','smoker']).size()

sex     smoker
Male    Yes       60
        No        97
Female  Yes       33
        No        54
dtype: int64

In [37]:
# 성별 팁 비율
tips.groupby('sex')[['tip_pct']].mean()

          tip_pct
sex
Male    15.765055
Female  16.649074

In [38]:
# 흡연유무에 따른 팁비율
tips.groupby('smoker')[['tip_pct']].mean()

          tip_pct
smoker
Yes     16.319604
No      15.932846

In [40]:
# 성별 흡연 유무에 따른 팁 비율
tips.groupby(['sex','smoker'])[['tip_pct']].mean()

                 tip_pct
sex    smoker
Male   Yes     15.277118
       No      16.066872
Female Yes     18.215035
       No      15.692097

In [41]:
tips.pivot_table("tip_pct","sex","smoker")

smoker        Yes         No
sex
Male    15.277118  16.066872
Female  18.215035  15.692097

### 연습 문제 4.7.3

* 팁의 비율이 요일과 점심/저녁 여부, 인원수에 어떤 영향을 받는지 살펴본다.

In [43]:
# 요일별
tips.groupby('day')[['tip_pct']].mean()

        tip_pct
day
Thur  16.127563
Fri   16.991303
Sat   15.315172
Sun   16.689729

In [44]:
# 점심 / 저녁 여부
tips.groupby('time')[['tip_pct']].mean()

          tip_pct
time
Lunch   16.412793
Dinner  15.951779

In [45]:
# 위 두개를 묶어서
tips.groupby(['day','time'])[['tip_pct']].mean()

               tip_pct
day  time
Thur Lunch   16.130074
     Dinner  15.974441
Fri  Lunch   18.876489
     Dinner  15.891611
Sat  Lunch         NaN
     Dinner  15.315172
Sun  Lunch         NaN
     Dinner  16.689729

In [47]:
# 피벗테이블 이용

tips.pivot_table("tip_pct","day","time")

time      Lunch     Dinner
day
Thur  16.130074  15.974441
Fri   18.876489  15.891611
Sat         NaN  15.315172
Sun         NaN  16.689729

In [51]:
# 인원수 추가
tips.pivot_table("tip_pct",['time',"size"],"day")

day               Thur        Fri        Sat        Sun
time   size
Lunch  1     18.172790  22.377622        NaN        NaN
       2     16.402425  18.196867        NaN        NaN
       3     14.459879  18.773467        NaN        NaN
       4     14.551515        NaN        NaN        NaN
       5     12.138869        NaN        NaN        NaN
       6     17.370592        NaN        NaN        NaN
Dinner 1           NaN        NaN  23.183197        NaN
       2     15.974441  16.265852  15.528884  18.086960
       3           NaN        NaN  15.143861  15.266238
       4           NaN  11.774956  13.828925  15.316820
       5           NaN        NaN  10.657194  15.983894
       6           NaN        NaN        NaN  10.379905